Revit 2027 API
Transform1D.TransformParameterDomain Method
 Performs a transform of the parameter range defined by domain, and ensures that the domain is ordered correctly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<double> TransformParameterDomain(
	double domainStart,
	double domainEnd
)
Public Function TransformParameterDomain (
	domainStart As Double,
	domainEnd As Double
) As IList(Of Double)
public:
IList<double>^ TransformParameterDomain(
	double domainStart,
	double domainEnd
)
member TransformParameterDomain :
        domainStart : float *
        domainEnd : float -> IList<float>
Parameters
domainStart Double
 The original parameter domain start.
domainEnd Double
 The original parameter domain end.
Return Value
IList<Double>
Remarks
 If the domain is empty it is unchanged.
See Also
Reference
Transform1D Class
Autodesk.Revit.DB Namespace